wrk/output/stage_5/5_range_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.294ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1573.564ms, rate sampling interval: 5328ms
  Thread calibration: mean lat.: 1669.655ms, rate sampling interval: 6062ms
  Thread calibration: mean lat.: 1613.597ms, rate sampling interval: 5677ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.24s     3.33s   10.04s    47.17%
    Req/Sec   263.42     71.49   777.00     89.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.71s 
 75.000%    7.11s 
 90.000%    8.52s 
 99.000%    9.58s 
 99.900%    9.99s 
 99.990%   10.04s 
 99.999%   10.05s 
100.000%   10.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.215     0.000000            1         1.00
       1.948     0.100000         1518         1.11
       3.777     0.200000         3036         1.25
       5.359     0.300000         4555         1.43
    3811.327     0.400000         6074         1.67
    4706.303     0.500000         7595         2.00
    5222.399     0.550000         8351         2.22
    5730.303     0.600000         9111         2.50
    6180.863     0.650000         9868         2.86
    6655.999     0.700000        10643         3.33
    7106.559     0.750000        11385         4.00
    7380.991     0.775000        11772         4.44
    7569.407     0.800000        12144         5.00
    7856.127     0.825000        12525         5.71
    8122.367     0.850000        12910         6.67
    8376.319     0.875000        13292         8.00
    8470.527     0.887500        13478         8.89
    8519.679     0.900000        13674        10.00
    8626.175     0.912500        13855        11.43
    8724.479     0.925000        14053        13.33
    8871.935     0.937500        14237        16.00
    8937.471     0.943750        14330        17.78
    9019.391     0.950000        14427        20.00
    9101.311     0.956250        14518        22.86
    9166.847     0.962500        14638        26.67
    9199.615     0.968750        14710        32.00
    9232.383     0.971875        14758        35.56
    9297.919     0.975000        14804        40.00
    9347.071     0.978125        14852        45.71
    9428.991     0.981250        14898        53.33
    9486.335     0.984375        14944        64.00
    9494.527     0.985938        14968        71.11
    9560.063     0.987500        15007        80.00
    9568.255     0.989062        15022        91.43
    9592.831     0.990625        15051       106.67
    9601.023     0.992188        15065       128.00
    9650.175     0.992969        15078       142.22
    9691.135     0.993750        15088       160.00
    9740.287     0.994531        15100       182.86
    9781.247     0.995313        15109       213.33
    9838.591     0.996094        15124       256.00
    9863.167     0.996484        15128       284.44
    9879.551     0.996875        15136       320.00
    9887.743     0.997266        15139       365.71
    9912.319     0.997656        15146       426.67
    9945.087     0.998047        15156       512.00
    9945.087     0.998242        15156       568.89
    9953.279     0.998437        15157       640.00
    9977.855     0.998633        15163       731.43
    9977.855     0.998828        15163       853.33
    9994.239     0.999023        15168      1024.00
    9994.239     0.999121        15168      1137.78
   10002.431     0.999219        15169      1280.00
   10010.623     0.999316        15170      1462.86
   10018.815     0.999414        15172      1706.67
   10027.007     0.999512        15175      2048.00
   10027.007     0.999561        15175      2275.56
   10027.007     0.999609        15175      2560.00
   10027.007     0.999658        15175      2925.71
   10035.199     0.999707        15177      3413.33
   10035.199     0.999756        15177      4096.00
   10035.199     0.999780        15177      4551.11
   10043.391     0.999805        15179      5120.00
   10043.391     0.999829        15179      5851.43
   10043.391     0.999854        15179      6826.67
   10043.391     0.999878        15179      8192.00
   10043.391     0.999890        15179      9102.22
   10043.391     0.999902        15179     10240.00
   10043.391     0.999915        15179     11702.86
   10043.391     0.999927        15179     13653.33
   10051.583     0.999939        15180     16384.00
   10051.583     1.000000        15180          inf
#[Mean    =     4242.254, StdDeviation   =     3332.308]
#[Max     =    10043.392, Total count    =        15180]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22817 requests in 30.00s, 1.13MB read
Requests/sec:    760.44
Transfer/sec:     38.62KB